import React, { Component } from "react";
import PropTypes from "prop-types";
import "./ArticlePage.css";
import "./Article1.css";
import { Helmet } from "react-helmet";
import FacebookPlayer from "react-facebook-player";
import YouTube from "react-youtube";
import HeaderBar from "./HeaderBar";

const Remarkable = require("remarkable");

const md = new Remarkable("full", {
	html: true,
	linkify: true,
	typographer: true,
	breaks: true,
});

/**
 *
 */
export default class ArticlePage extends Component {

    static contextTypes = {
		config: PropTypes.object,
	};
    renderVideo(url) {
		const APP_ID = this.context.config.appId;

		if (/facebook.com/.test(url)) {
			let videoId = url.replace(/.*facebook.com\/.*\/videos\/(.*)\/.*/, "$1");

			return <FacebookPlayer className={"Facebook"} videoId={videoId} appId={APP_ID} />;
		} else if (/youtube.com/) {
			let videoId = url.replace(/^.*((youtu.be\/)|(v\/)|(\/u\/\w\/)|(embed\/)|(watch\?))\??v?=?([^#&?]*).*/, "$7");
			return <YouTube videoId={videoId} className={"YouTube"} />;
		}
		return null;
	}
    render() {

		return (
			<div ref={r => (this._ref = r)} className={["ArticlePage", loading ? "loading" : "loaded"].join(" ")}></div>
		
			<title> الوضع القانوني لبعض اللاجئين السوريين غير المسجلين</title>
            <article>
                # الوضع القانوني لبعض اللاجئين السوريين غير المسجلين

## كيف ممكن قدّم على برنامج العفو قبل انتهائه في شهر أيلول (سبتمبر)؟

Posted 20 hours ago

<div id="tldr">

*   برنامج مفتوح لأي لاجئ قادم من سوريا وغير مسجّل في الأردن باستثناء من غادر مخيّمه في أو بعد 1 تموز (يوليو) 2017
*   آخر موعد للتقديم هو 27 أيلول (سبتمبر) 2018
*   يُمكن لبعض المنظمات غير الحكومية (NGOs) مساعدتك في عمليّة التقديم

</div>

![UNICEF Amnesty Program](public/images/article1.png)

<div id="maincontent">إذا كنت تعيش بدون وثائق قانونية، يمكن لبرنامج عفو جديد أن يساعدك في تسوية وضعك القانوني في الأردن -- بشرط أنّك لم تغادر المخيّم بشكل غير قانوني في أو بعد 1 يوليو 2017\.  
أعلنت وزارة الداخلية الأردنية ومفوضيّة اللاجئين (UNHCR) عن برنامج العفو هذا في 4 آذار (مارس) 2018.  
**آخر موعد للتقديم هو 27 أيلول (سبتمبر) 2018**

اقرأ [البيان الصحفي](https://reliefweb.int/sites/reliefweb.int/files/resources/Amnestyposter_Arabiccopy_FINAL.pdf) الصادر عن مفوضية اللاجئين حول برنامج العفو.

**لحظة بس، سمعت انو اذا سجلت بهاد البرنامج فممكن يرجعوني على المخيم.**

<div>ليس هناك أيّ دليل على صحة هذه الشائعات. في أول شهر من البرنامج:

*   سجلت مفوضية اللاجئين 30,000 شخصاً
*   تلقى أكثر من 10,000 شخص مستنداتهم

</div>

**مين بقدر يقدّم على هاد البرنامج**

*   إذا سجّلت لدى مفوضيّة اللاجئين في مخيّم ومن ثم غادرت المخيّم **قبل** تموز (يوليو) 2017 بدون إذن، عندها يُمكنك التقديم.
*   إذا سجّلت لدى مفوضيّة اللاجئين في مخيّم ومن ثم غادرت المخيّم **قبل** 1 تموز (يوليو) 2017 بإذن رسمي ولم تعد قبل حلول الموعد النهائي، عندها يُمكنك التقديم.
*   إذا لم تقم مطلقاً بالتسجيل لدى مفوضيّة اللاجئين، عندها أيضاً يُمكنك التقديم.

**مين ما بقدر يقدّم عالبرنامج؟**

*   إذا سجّلت لدى مفوضيّة اللاجئين في مخيّم ومن ثم غادرت المخيّم **بحلول أو بعد** تموز (يوليو) 2017، عندها **لا يُمكنك** التقديم للاستفادة من برنامج العفو.

**كيف تعمل هذه العملية**</div>

<div id="process">

## كيف تعمل هذه العملية

1.  جهّز وثائقك وأوراقك للتقديم. سيلزمك:
    *   مستند "ا"
    *   مستند "ا"
    *   مستند "ا"
2.  أحضر وثائقك معك وتوجّه إلى أقرب مكتب لمفوضيّة اللاجئين، أو قم بزيارة إحدى المنظمات الغير حكومية التي يُمكنها المساعدة في عمليّة التقديم.  
    يُمكنك إيجاد أقرب مكتب لمفوضيّة اللاجئين [هنا.](/)  
    يُمكنك إيجاد أقرب منظمة غير حكومية يُمكنها مساعدتك [هنا](/)
3.  إنتظر إلى أن يتم التواصل معك.
4.  إذهب لاستلام الوثائق الجديدة.

**الظاهر القصة سهلة وبسيطة. فيك تحكيلي أكتر عن إجراءات التقديم؟**

أكيد. توقّع الإنتظار لبعض الوقت داخل مكتب مفوضيّة اللاجئين. تتعهّد بعض [المنظمات الغير حكومية التي يُمكنها مساعدتك في التقديم](/) ، بمساعدتك في تجنّب طوابير الانتظار.

هل شاهدت مقطع الفيديو الذي أعدّته مفوضيّة اللاجئين حول عمليّة التقديم؟ شاهده من هنا:

{renderVideo("https://www.facebook.com/UNHCRJordan/videos/2107235179293443/")} **شو لازم أعمل بعد هيك؟**

<div>

بمجرّد حصولك على الوثائق الجديدة، ستتمكّن من الوصول والاستفادة من العديد من الخدمات، من ضمنها:

[الخدمات الصحية](/)  
[التعليم](/)  
[خدمات أخرى](/)  
</div>

كذلك سيكون بإمكانك الحصول على شهادات ووثائق هامة للغاية مثل شهادات الميلاد وشهادات الزواج. تعرّف على المزيد:

[الشهادات الهامّة](/) **عندي كم سؤال إضافيّات.**

أكيد مو مشكلة. تفضّل بزيارة صفحة الأسئلة الشائعة، أو أرسل لنا [رسالة عبر الفيسبوك](https://www.facebook.com/khabrona.info1) أو من خلال تطبيق خبرونا (Khabrona.Info). سنقوم بالرّد على أسئلتك في أقرب وقت مُمكن. ,

</div>

            </article>
		);
	}
}
